Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/LTDC/ltdc.c
    if (driver->layers[srcLayer].framebufferAddress == 0 || driver->layers[dstLayer].framebufferAddress == 0) {
        driver->errorCode = LTDC_ERROR_FRAMEBUFFER;
        return HAL_ERROR;
    }

    /* Calculate size based on pixel format */
    uint32_t srcSize = driver->layers[srcLayer].imageWidth * driver->layers[srcLayer].imageHeight;
    uint32_t dstSize = driver->layers[dstLayer].imageWidth * driver->layers[dstLayer].imageHeight;

    /* Use smaller size for safety */
    uint32_t copySize = (srcSize < dstSize) ? srcSize : dstSize;

    /* Calculate bytes per pixel */
    uint32_t bytesPerPixel = 4; /* Default to 32-bit */
    if (driver->layers[srcLayer].pixelFormat == LTDC_PIXEL_FORMAT_RGB565_ENUM) {
        bytesPerPixel = 2;
    } else if (driver->layers[srcLayer].pixelFormat == LTDC_PIXEL_FORMAT_RGB888_ENUM) {
        bytesPerPixel = 3;
    }

    /* Copy framebuffer */
    memcpy((void *)driver->layers[dstLayer].framebufferAddress,
           (void *)driver->layers[srcLayer].framebufferAddress,
           copySize * bytesPerPixel);

    return HAL_OK;
}

/**
 * @brief Draw pixel at specified coordinates
 * @param driver: Pointer to LTDC driver structure
 * @param x: X coordinate
 * @param y: Y coordinate
 * @param color: Pixel color
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_DrawPixel(LTDC_Driver_t *driver, uint16_t x, uint16_t y, uint32_t color) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateCoordinates(x, y) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    uint8_t layer = driver->activeLayer;
    LTDC_LayerConfig_t *l = &driver->layers[layer];
    if (l->framebufferAddress == 0) {
        driver->errorCode = LTDC_ERROR_FRAMEBUFFER;
        return HAL_ERROR;
    }

    /* Ensure pixel is inside layer window */
    if (x < l->windowX0 || x > l->windowX1 || y < l->windowY0 || y > l->windowY1) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    /* Compute index within the image buffer (row-major) */
    uint32_t ix = x - l->windowX0;
    uint32_t iy = y - l->windowY0;
    uint32_t index = iy * l->imageWidth + ix;

    uint8_t *fbBase = (uint8_t *)(uintptr_t)l->framebufferAddress;
    LTDC_SetPixelByIndex(fbBase, index, color, l->pixelFormat);

    return HAL_OK;
}

/* Removed complex drawing helpers to keep LTDC driver small and focused.
 * Complex drawing (lines, rectangles, circles, fonts, bitmaps) should be
 * implemented in application code or a GUI library (e.g., LVGL). This
 * reduces driver size and keeps the LTDC module correct and maintainable.
 */


/**
 * @brief Set background color
 * @param driver: Pointer to LTDC driver structure
 * @param color: Background color
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_SetBackgroundColor(LTDC_Driver_t *driver, uint32_t color) {
    if (LTDC_ValidateDriver(driver) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    uint32_t blue = (color) & 0xFF;
    uint32_t green = (color >> 8) & 0xFF;
    uint32_t red = (color >> 16) & 0xFF;

    /* Write directly to LTDC background color register (BCCR) */
    driver->hltdc->Instance->BCCR = (red << 16) | (green << 8) | blue;
    __HAL_LTDC_RELOAD_CONFIG(driver->hltdc);

    driver->displayConfig.backgroundColor = color;
    return HAL_OK;
}

/**
 * @brief Display on
 * @param driver: Pointer to LTDC driver structure
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_DisplayOn(LTDC_Driver_t *driver) {
    if (LTDC_ValidateDriver(driver) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    /* Enable LTDC */
    __HAL_LTDC_ENABLE(driver->hltdc);

    return HAL_OK;
}

/**
 * @brief Display off
 * @param driver: Pointer to LTDC driver structure
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_DisplayOff(LTDC_Driver_t *driver) {
    if (LTDC_ValidateDriver(driver) != HAL_OK) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    /* Disable LTDC */
    __HAL_LTDC_DISABLE(driver->hltdc);

    return HAL_OK;
}

/**
 * @brief Set display brightness (platform dependent; default stub)
 * @param driver: Pointer to LTDC driver structure
 * @param brightness: Brightness percent (0-100)
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_SetDisplayBrightness(LTDC_Driver_t *driver, uint8_t brightness) {
    if (LTDC_ValidateDriver(driver) != HAL_OK) {
        return HAL_ERROR;
    }

    if (brightness > 100) {
        return HAL_ERROR;
    }

    /* Platform-specific: hook up to PWM/backlight if available. For now, store nothing and return OK. */
    (void)driver;
    (void)brightness;

    return HAL_OK;
}

/* Utility Functions ---------------------------------------------------------*/

/**
 * @brief Convert color between different pixel formats
 * @param color: Input color
 * @param fromFormat: Source pixel format
 * @param toFormat: Target pixel format
 * @return uint32_t: Converted color
 */
uint32_t LTDC_ConvertColor(uint32_t color, LTDC_PixelFormat_t fromFormat, LTDC_PixelFormat_t toFormat) {
    if (fromFormat == toFormat) {
        return color;
    }

    /* Convert to RGB888 as intermediate format */
    uint32_t rgb888 = 0U; /* initialize to silence static analysis */

    switch (fromFormat) {
        case LTDC_PIXEL_FORMAT_RGB565_ENUM:
            rgb888 = LTDC_RGB565_To_RGB888((uint16_t)color);
            break;
        case LTDC_PIXEL_FORMAT_ARGB8888_ENUM:
            rgb888 = color & 0x00FFFFFF; /* Remove alpha */
            break;
        default:
            rgb888 = color;
            break;
    }

    /* Convert from RGB888 to target format */
    switch (toFormat) {
        case LTDC_PIXEL_FORMAT_RGB565_ENUM:
            return LTDC_RGB888_To_RGB565(rgb888);
        case LTDC_PIXEL_FORMAT_ARGB8888_ENUM:
            return rgb888 | 0xFF000000; /* Add full alpha */
        default:
            return rgb888;
    }
}

/**
 * @brief Convert RGB888 to RGB565
 * @param rgb888: 24-bit RGB color
 * @return uint32_t: 16-bit RGB565 color
 */
uint32_t LTDC_RGB888_To_RGB565(uint32_t rgb888) {
    uint32_t r = (rgb888 >> 16) & 0xFF;
    uint32_t g = (rgb888 >> 8) & 0xFF;
    uint32_t b = rgb888 & 0xFF;

    return ((r >> 3) << 11) | ((g >> 2) << 5) | (b >> 3);
}

/**
 * @brief Convert RGB565 to RGB888
 * @param rgb565: 16-bit RGB565 color
 * @return uint32_t: 24-bit RGB888 color
 */
uint32_t LTDC_RGB565_To_RGB888(uint16_t rgb565) {
    uint32_t r = (rgb565 >> 11) & 0x1F;
    uint32_t g = (rgb565 >> 5) & 0x3F;
    uint32_t b = rgb565 & 0x1F;

    r = (r << 3) | (r >> 2);
    g = (g << 2) | (g >> 4);
    b = (b << 3) | (b >> 2);

