Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/LTDC/ltdc.c
    return (r << 16) | (g << 8) | b;
}

/**
 * @brief Convert ARGB8888 to RGB565
 * @param argb8888: 32-bit ARGB color
 * @return uint32_t: 16-bit RGB565 color
 */
uint32_t LTDC_ARGB8888_To_RGB565(uint32_t argb8888) {
    return LTDC_RGB888_To_RGB565(argb8888 & 0x00FFFFFF);
}

/**
 * @brief Get layer information
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number
 * @param info: Pointer to layer info structure
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_GetLayerInfo(LTDC_Driver_t *driver, uint8_t layer, LTDC_LayerConfig_t *info) {
    if (LTDC_ValidateDriver(driver) != HAL_OK || LTDC_ValidateLayer(layer) != HAL_OK || info == NULL) {
        driver->errorCode = LTDC_ERROR_INVALID_PARAM;
        return HAL_ERROR;
    }

    *info = driver->layers[layer];
    return HAL_OK;
}

/**
 * @brief Check if layer is enabled
 * @param driver: Pointer to LTDC driver structure
 * @param layer: Layer number
 * @return bool: true if enabled, false otherwise
 */
bool LTDC_IsLayerEnabled(LTDC_Driver_t *driver, uint8_t layer) {
    if (driver == NULL || layer >= LTDC_MAX_LAYERS) {
        return false;
    }
    return driver->layers[layer].enabled;
}

/**
 * @brief Get last error code
 * @param driver: Pointer to LTDC driver structure
 * @return uint32_t: Error code
 */
uint32_t LTDC_GetError(LTDC_Driver_t *driver) {
    if (driver == NULL) {
        return LTDC_ERROR_INVALID_PARAM;
    }
    return driver->errorCode;
}

/**
 * @brief Clear error code
 * @param driver: Pointer to LTDC driver structure
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_ClearError(LTDC_Driver_t *driver) {
    if (driver == NULL) {
        return HAL_ERROR;
    }
    driver->errorCode = LTDC_ERROR_NONE;
    return HAL_OK;
}



/**
 * @brief Hardware initialization
 * @return HAL_StatusTypeDef: HAL status
 */
HAL_StatusTypeDef LTDC_HW_Init(void) {

    /* Initialize LTDC Peripheral (RGB interface only) */

    /* Enable LTDC clock */
    __HAL_RCC_LTDC_CLK_ENABLE();

    /* Configure LTDC peripheral */
    hltdc.Instance = LTDC;

    /* Signal polarities - MUST MATCH ILI9341 RGB interface settings! */
    hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;   // HSYNC active low
    hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;   // VSYNC active low
    hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;   // DE active low
    hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;  // Pixel clock inverted


    // Timing parameters for STM32F429I-DISC1 LCD (RGB interface)
    hltdc.Init.HorizontalSync = 9;   // HSYNC width - 1
    hltdc.Init.VerticalSync = 1;     // VSYNC height - 1
    hltdc.Init.AccumulatedHBP = 29;  // HSYNC + HBP - 1
    hltdc.Init.AccumulatedVBP = 3;   // VSYNC + VBP - 1
    hltdc.Init.AccumulatedActiveW = 269;  // HSYNC + HBP + Width - 1 (240)
    hltdc.Init.AccumulatedActiveH = 323;  // VSYNC + VBP + Height - 1 (320)
    hltdc.Init.TotalWidth = 279;     // Total horizontal - 1
    hltdc.Init.TotalHeigh = 327;     // Total vertical - 1

    /* Background color (black) */
    hltdc.Init.Backcolor.Blue = 0;
    hltdc.Init.Backcolor.Green = 0;
    hltdc.Init.Backcolor.Red = 0;

    /* Initialize LTDC */
    if (HAL_LTDC_Init(&hltdc) != HAL_OK) {
        return HAL_ERROR;
    }

    /* Configure Layer 1 */
    LTDC_LayerCfgTypeDef layerCfg = {0};
    layerCfg.WindowX0 = 0;
    layerCfg.WindowX1 = 239;  // 240 pixels wide (inclusive)
    layerCfg.WindowY0 = 0;
    layerCfg.WindowY1 = 319;  // 320 pixels tall (inclusive)
    layerCfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB565;
    layerCfg.Alpha = 255;
    layerCfg.Alpha0 = 0;
    layerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
    layerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;
    layerCfg.FBStartAdress = 0xD0000000;  // SDRAM framebuffer
    layerCfg.ImageWidth = 240;
    layerCfg.ImageHeight = 320;
    layerCfg.Backcolor.Blue = 0;
    layerCfg.Backcolor.Green = 0;
    layerCfg.Backcolor.Red = 0;

    if (HAL_LTDC_ConfigLayer(&hltdc, &layerCfg, 0) != HAL_OK) {
        return HAL_ERROR;
    }

    /* Enable Layer 1 */
    __HAL_LTDC_LAYER_ENABLE(&hltdc, 0);
    __HAL_LTDC_RELOAD_CONFIG(&hltdc);  // Reload at VSYNC

    return HAL_OK;
}

/**
 * @brief Initialize LTDC MSP (wrapper for HAL_LTDC_MspInit)
 * @param hltdc: Pointer to LTDC handle
 */
void LTDC_MspInit(LTDC_HandleTypeDef *hltdc) {
    HAL_LTDC_MspInit(hltdc);
}

/**
 * @brief De-initialize LTDC MSP (wrapper for HAL_LTDC_MspDeInit)
 * @param hltdc: Pointer to LTDC handle
 */
void LTDC_MspDeInit(LTDC_HandleTypeDef *hltdc) {
    HAL_LTDC_MspDeInit(hltdc);
}

/* Private Functions ---------------------------------------------------------*/

/**
 * @brief Validate driver handle
 * @param driver: Pointer to LTDC driver structure
 * @return HAL_StatusTypeDef: HAL status
 */
static HAL_StatusTypeDef LTDC_ValidateDriver(LTDC_Driver_t *driver) {
    if (driver == NULL || !driver->initialized || driver->hltdc == NULL) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/**
 * @brief Validate layer number
 * @param layer: Layer number
 * @return HAL_StatusTypeDef: HAL status
 */
static HAL_StatusTypeDef LTDC_ValidateLayer(uint8_t layer) {
    if (layer >= LTDC_MAX_LAYERS) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/**
 * @brief Validate coordinates
 * @param x: X coordinate
 * @param y: Y coordinate
 * @return HAL_StatusTypeDef: HAL status
 */
static HAL_StatusTypeDef LTDC_ValidateCoordinates(uint16_t x, uint16_t y) {
    if (x >= LTDC_DISPLAY_WIDTH || y >= LTDC_DISPLAY_HEIGHT) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/**
 * @brief Validate rectangle
 * @param rect: Pointer to rectangle structure
 * @return HAL_StatusTypeDef: HAL status
 */
static HAL_StatusTypeDef LTDC_ValidateRect(LTDC_Rect_t *rect) {
    if (rect == NULL ||
        rect->x >= LTDC_DISPLAY_WIDTH ||
        rect->y >= LTDC_DISPLAY_HEIGHT ||
        (rect->x + rect->width) > LTDC_DISPLAY_WIDTH ||
        (rect->y + rect->height) > LTDC_DISPLAY_HEIGHT) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/**
 * @brief Get HAL pixel format from driver format
 * @param format: Driver pixel format
 * @return uint32_t: HAL pixel format
 */
static uint32_t LTDC_GetPixelFormatHAL(LTDC_PixelFormat_t format) {
    switch (format) {
        case LTDC_PIXEL_FORMAT_ARGB8888_ENUM: return LTDC_PIXEL_FORMAT_ARGB8888;
        case LTDC_PIXEL_FORMAT_RGB888_ENUM: return LTDC_PIXEL_FORMAT_RGB888;
        case LTDC_PIXEL_FORMAT_RGB565_ENUM: return LTDC_PIXEL_FORMAT_RGB565;
        case LTDC_PIXEL_FORMAT_ARGB1555_ENUM: return LTDC_PIXEL_FORMAT_ARGB1555;
        case LTDC_PIXEL_FORMAT_ARGB4444_ENUM: return LTDC_PIXEL_FORMAT_ARGB4444;
        case LTDC_PIXEL_FORMAT_L8_ENUM: return LTDC_PIXEL_FORMAT_L8;
        case LTDC_PIXEL_FORMAT_AL44_ENUM: return LTDC_PIXEL_FORMAT_AL44;
        case LTDC_PIXEL_FORMAT_AL88_ENUM: return LTDC_PIXEL_FORMAT_AL88;
        default: return LTDC_PIXEL_FORMAT_ARGB8888;
    }
}

/**
 * @brief Get driver pixel format from HAL format
 * @param halFormat: HAL pixel format
 * @return LTDC_PixelFormat_t: Driver pixel format
 */


/**
 * @brief Set pixel in framebuffer
 * @param framebuffer: Framebuffer pointer
 * @param x: X coordinate
 * @param y: Y coordinate
 * @param color: Pixel color
 * @param format: Pixel format
 */
/* Removed legacy per-scanline Set/Get pixel logic that assumed full display stride.
 * Use LTDC_SetPixelByIndex / LTDC_GetPixelByIndex for image-buffer-indexed access.
 */

/* Line helpers removed to simplify driver; use application-level routines if needed. */

/* New helper: set pixel by linear index (row-major) where framebuffer base is a byte pointer */
static void LTDC_SetPixelByIndex(uint8_t *fbBase, uint32_t index, uint32_t color, LTDC_PixelFormat_t format) {
    switch (format) {
        case LTDC_PIXEL_FORMAT_RGB565_ENUM: {
            uint16_t *fb16 = (uint16_t *)fbBase;
            fb16[index] = (uint16_t)color;
            break;
        }
        case LTDC_PIXEL_FORMAT_RGB888_ENUM: {
            uint8_t *p = fbBase + index * 3;
            p[0] = (color) & 0xFF;        /* Blue */
            p[1] = (color >> 8) & 0xFF;  /* Green */
            p[2] = (color >> 16) & 0xFF; /* Red */
            break;
        }
        case LTDC_PIXEL_FORMAT_ARGB8888_ENUM:
        default: {
            uint32_t *fb32 = (uint32_t *)fbBase;
            fb32[index] = color;
            break;
        }
    }
}

/* GetPixelByIndex removed (unused) to keep the driver small. */

/* Bitmap/font helpers removed: use LVGL or application-level routines for text and complex image drawing. */
